app/controllers/api/v1/episodes_controller.rb

SELECT  "tvshows".* FROM "tvshows" INNER JOIN "episodes" ON "episodes"."tvshow_id" = "tvshows"."id" INNER JOIN "videos" ON "videos"."episode_id" = "episodes"."id" WHERE "tvshows"."identifier" = 'teste'  ORDER BY "tvshows"."id" ASC LIMIT 1
SELECT "episodes".* FROM "episodes"  WHERE "episodes"."tvshow_id" IN (1)
SELECT "videos".* FROM "videos"  WHERE "videos"."episode_id" IN (1)
---
  def index
    return unless params[:tvshow].present?

    tvshow = Tvshow.includes(:episodes, episodes: :videos).where(identifier: params[:tvshow]).first

SELECT  "episodes".* FROM "episodes"  WHERE (identifier = 'tesas' and rabbi = 'tesas' )  ORDER BY "order" ASC LIMIT 1
SELECT  "videos".* FROM "videos"  WHERE "videos"."episode_id" = $1 AND (identifier = 'asdasd')  ORDER BY "order" ASC LIMIT 1  [["episode_id", 1]]
---
  def show
    return if !params[:identifier].present? || !params[:rabbi].present?

    @episode = Episode.where("identifier = ? and rabbi = ? ", params[:identifier], params[:rabbi]).first
    current = @episode.videos.where("identifier = ?", params[:current]).first if params[:current].present?
    current = @episode.videos.first if !params[:current].present? or current.nil?
    @next = @episode.videos.where('"order" > ?', current.order).first