app/controllers/api/v1/tvshows_controller.rb

SELECT "tvshows".* FROM "tvshows"
---
  def index
    if params[:callback]
      render :json => Tvshow.all.to_json, :callback => params[:callback], :content_type => 'application/javascript'