app/controllers/episodes_controller.rb

  def index
    @episodes = Episode.all.order :order
---
SELECT "episodes".* FROM "episodes"   ORDER BY "order" ASC, "episodes"."order" ASC

  def create
    @episode = Episode.new(episode_params)
    load_form_data

    respond_to do |format|
      if @episode.save
        video = Video.new()
        video.title = @episode.title
        video.episode = @episode
        video.identifier = @episode.identifier
        video.order = 1
        video.save
---
INSERT INTO "episodes" ("created_at", "description", "identifier", "order", "publication", "title", "tvshow_id", "updated_at") VALUES ('2014-06-17 18:26:43.697000', '', 'teste', 1, '2014-06-17 18:26:00.000000', 'teste', 1, '2014-06-17 18:26:43.697000') RETURNING "id"
INSERT INTO "videos" ("created_at", "episode_id", "identifier", "order", "title", "updated_at") VALUES ('2014-06-17 18:36:17.732000', 2, 'teste2', 1, 'teste2', '2014-06-17 18:36:17.732000') RETURNING "id"

    def set_episode
      @episode = Episode.find(params[:id])
---
SELECT  "episodes".* FROM "episodes"  WHERE "episodes"."id" = 1 LIMIT 1

    def load_form_data
      @tvshows = Tvshow.all
---
SELECT "tvshows".* FROM "tvshows"