app/controllers/tvshows_controller.rb

  def index
    @tvshows = Tvshow.all.order :order
---
SELECT "tvshows".* FROM "tvshows"   ORDER BY "order" ASC, "tvshows"."order" ASC

  def create
    @tvshow = Tvshow.new(tvshow_params)

    respond_to do |format|
      if @tvshow.save
---
INSERT INTO "tvshows" ("created_at", "description", "featured", "identifier", "name", "order", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", "2014-12-09 13:20:26.846331"], ["description", ""], ["featured", "f"], ["identifier", "teste"], ["name", "teste"], ["order", 1], ["updated_at", "2014-12-09 13:20:26.846331"]]

    def set_tvshow
      @tvshow = Tvshow.find(params[:id])
---
SELECT  "tvshows".* FROM "tvshows"  WHERE "tvshows"."id" = 1 LIMIT 1