app/controllers/videos_controller.rb

INSERT INTO "videos" ("amazon_identifier", "created_at", "description", "episode_id", "identifier", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @video = Video.new(video_params)
    load_form_data

    respond_to do |format|
      if @video.save

UPDATE "videos" SET "amazon_identifier" = 'Video03', "description" = '', "identifier" = 'teste11', "updated_at" = '2014-06-18 02:57:30.980000' WHERE "videos"."id" = 1
---
  def update
    load_form_data

    respond_to do |format|
      if @video.update(video_params)

SELECT "episodes".* FROM "episodes"
---
    def load_form_data
      @episodes = Episode.all